app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(:title => params[:title], :description => params[:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-01-09 04:09:40.639603"], ["id", 1]]